#include "stdafx.h"
#include "ListOfTripsAndCosts.h"
#include <QtWidgets/QApplication>

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    ListOfTripsAndCosts w;
    w.show();
    return a.exec();
}
/*Варіант 10: Список Подорожей та Витрат

Завдання:

Створення Таблиці для Подорожей:

Створити таблицю "Подорожі" з полями: ID подорожі, Країна, Місто, Дата виїзду, Дата повернення.

Створення Таблиці для Витрат:

Створити таблицю "Витрати" з полями: ID витрат, ID подорожі, Сума, Опис витрати.
Імітація Заповнення та Виведення Даних:

Заповнити табличні моделі імітованими даними про подорожі та витрати.
Реалізувати вивід цих даних у відповідні елементи графічного інтерфейсу.
Операції Зміни Даних:

Додати можливість додавання нових подорожей та витрат, видалення та оновлення інформації.
Виводити зміни на екран та зберігати їх в табличних моделях.
 Сортування та Фільтрація:

Забезпечити можливість сортування подорожей за датою виїзду чи країною.
Додати функціонал фільтрації витрат за сумою чи описом.*/